Revit 2027 API
CylindricalHelix.ZVector Property
The Z direction vector, which is same as the axis direction vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ZVector { get; }
Public ReadOnly Property ZVector As XYZ
	Get
public:
property XYZ^ ZVector {
	XYZ^ get ();
}
member ZVector : XYZ with get
Property Value
XYZ
See Also
Reference
CylindricalHelix Class
Autodesk.Revit.DB Namespace